external-services-mocks-deprecato/paleo-test/src/main/resources/OSGI-INF/blueprint/a.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
                       xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
                       soap:mustUnderstand="1">
            <wsu:Timestamp wsu:Id="TS-1B8784B240BB8396AA14254898726392">
                <wsu:Created>2015-03-04T17:24:32.638Z</wsu:Created>
                <wsu:Expires>2015-03-04T17:29:32.638Z</wsu:Expires>
            </wsu:Timestamp>
            <wsse:UsernameToken wsu:Id="UsernameToken-1B8784B240BB8396AA14254898726351">
                <wsse:Username>R_MARCHE\SGG.FATTUREPA</wsse:Username>
                <wsse:Password
                        Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">
                    paleo
                </wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
    </SOAP-ENV:Header>
    <soap:Body>
        <FindOperatori xmlns="http://paleo.regione.marche.it/services/"
                >
            <cognome></cognome>
            <codiceFiscale>DMSLGU80P18A944X</codiceFiscale>
        </FindOperatori>
    </soap:Body>
</soap:Envelope>
